Revit 2027 API
BuiltInFailures.RebarFailures.RebarHookOverEndTreatment Property
 Cannot add hook to the end that already has an end treatment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarHookOverEndTreatment { get; }
Public Shared ReadOnly Property RebarHookOverEndTreatment As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarHookOverEndTreatment {
	FailureDefinitionId^ get ();
}
static member RebarHookOverEndTreatment : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace